//*****************************************************************************
//!	@file	Engine/Create/Object.cpp
//!	@brief	
//!	@note	オブジェクトクラス
//!	@note	オブジェクトの元となる
//!	@author	YadoumaruRyusei
//*****************************************************************************

#include "Object.h"

//-----------------------------------------------------------------------------
// スタティック　メンバー
//-----------------------------------------------------------------------------
int Create::Object::ObjectNum = 0;

//==============================================================================
//!	@fn		Start
//!	@brief	初期化
//!	@note	ここにオブジェクトの初期化処理を記述する
//!	@note	処理がない場合はオーバーライドしなくてよい
//!	@param	
//!	@retval	true:正常終了　false:異常終了
//==============================================================================
bool Create::Object::Start()
{
	return true;
}

//==============================================================================
//!	@fn		Update
//!	@brief	更新
//!	@note	ここにオブジェクトの更新処理を記述する
//!	@note	処理がない場合はオーバーライドしなくてよい
//!	@param	
//!	@retval	true:正常終了　false:異常終了
//==============================================================================
bool Create::Object::Update()
{
	return true;
}

//==============================================================================
//!	@fn		End
//!	@brief	終了処理
//!	@note	ここにオブジェクトの終了処理を記述する
//!	@note	処理がない場合はオーバーライドしなくてよい
//!	@param	
//!	@retval	true:正常終了　false:異常終了
//==============================================================================
bool Create::Object::End()
{
	return true;
}

//==============================================================================
//!	@fn		ToString
//!	@brief	オブジェクト名前取得
//!	@param	
//!	@retval	オブジェクト名前
//==============================================================================
std::string Create::Object::ToString() const
{
	return name;
}
